[
    {
        "id": "posture1116"
        , "title": "Why posture is crucial to your health!"
        , "imageUrl": "img/blogPage/posture1116.jpg"
        , "paragraph": [
            "Here at Elevate Health & Fitness, one of the first things we do is assess your posture. Why is this so important? Well, posture not only plays a significant role in how efficiently you move, but also in relation to your overall health."
            , "I’m sure you’ve all thought about your posture at one point or another, trying to stand up straighter or sit more ergonomically, indeed, I remember being told by my parents to ‘stand up straight’ and I now find myself repeating this to my kids!"
            , "So what is posture? Well, Paul Chek defines posture as:"
            ,"<cite>'The position from which movement begins and ends’<cite>"
            , "with ideal posture being:"
            , "<cite>‘That state of muscular and skeletal balance, which protects the supporting structures of the body against injury or progressive deformity, irrespective of the attitude in which these structures are working or resting. It is during a state of ideal posture that the muscles will function most efficiently.’</cite>"
            , "If you have poor posture, it negatively effects how you look and feel, overloading your muscles, joints and tendons, often leading to pain and injury if not addressed. The rest of your body is also affected as your internal organs are not optimally supported and your circulation and breathing becomes impaired, fostering an environment for disease and dysfunction."
            , "Indeed, if the exercise program you are following does not address your posture, this can potentially lead to disastrous and expensive consequences. Detrimental results of poorly designed, inappropriate exercise programs include but are not limited to: muscle imbalance, nerve entrapment, altered biomechanics, increased pressure on nerve roots, damage to joint capsules and inert structures, increased risk of injury to muscles, ligaments and tendons, poor neuromuscular control, altered movement patterns, faulty motor engram development, overall dysfunction and pain." 
            , "Improving and maintaining your ideal posture allows your body to be optimally aligned, with your muscles in balance, whilst also creating the optimal conditions for all the systems of your body to work effectively, with benefits including:"
            , "<ul><li>Reduced chance of injury due to less stress on joints, ligaments, tendons and muscles.</li><li>Improved performance in not only your chosen sport, but also in your work and day to day activities, as your body will move more efficiently, with better balance and increased ability to generate force and movement.</li><li>You will also look and feel better with an ideal posture, improving your self-confidence and overall well-being!</li></ul>"
            , "So, as you can see, posture is very important and this is why here at Elevate Health & Fitness we not only assess you at the beginning of your journey, we also ensure your programs are designed to improve and help you maintain your optimal posture, with further regular assessments to ensure you are on the right track!"
            , "If you would like us to help you improve your posture, whatever your health and fitness goals are, please do not hesitate to <a href='contactUs.php'>contact us</a> for a free, no obligation consultation and let us help you to Elevate your health!"
        ]
    },
    {
        "id": "christmas1216"
        , "title": "Maintaining your health over Christmas"
        , "imageUrl": "img/blogPage/christmas1216.jpg"
        , "paragraph": [
            "With the festive season all but upon us, I’m sure many of you are all extremely busy trying to get everything organised (shopping, presents, pantomimes, work, decorations, etc.). Unfortunately this can often leave you feeling highly stressed, tired, more susceptible to illness or injury and burnt out and exhausted by the time the big day actually arrives!"
            , "By employing a few simple strategies you can ensure you not only ‘survive’ the festive season, but also enjoy the festivities without degrading your health too much and don’t have to start 2017 from a point of poor health and fitness!"
            , "Try and integrate these simple things into your daily routine as much as possible to maintain optimal health:"
            , "<strong>HYDRATION:</strong> Keep well hydrated by drinking plenty of good quality water (ideally filtered with a pinch of good quality sea salt added to improve taste and mineral content). Keep a glass or stainless steel bottle with you throughout the day, taking regular drinks to keep you well hydrated."
            , "A good signal that you are well hydrated can be seen from the colour of your urine, the clearer, pale yellow the colour the more hydrated you are and the darker, yellower it is the more dehydrated you are, meaning you need to up your intake! Keeping well hydrated can also help limit the side effects of any ‘partying’ involving alcohol, which if you do participate in, try and minimise the amount of alcohol and drink water in between drinks!"
            , "<strong>GOOD FOOD:</strong> Ideally keep your food choices from organic, free-range, pasture raised sources, to help keep to a minimum any toxins or chemicals you ingest. This will also ensure you get a greater amount of nutrients that the body needs to function optimally. Ensure your diet consists mainly of:<ul><li>vegetables (especially green leafy veg);</li><li>fresh fruit, especially berries;</li><li>good fats including coconut oil, butter, ghee and olive oil and from eggs, avocados, nuts and cheese (ideally unpasteurised);</li><li>plenty of good quality protein from meats and fish.</li></ul>"
            , "When drinking alcohol, it is also a good idea to eat some fatty foods (as suggested above) prior to drinking and during your party, to help keep your blood sugar levels in check and to help reduce the side effects."
            , "<strong>SLEEP:</strong> Ensuring you get enough quality sleep will have a massive impact on how you feel and your overall health. So try and limit the number of late nights and aim to keep your sleep patterns regular, ideally getting to be by 10-10.30pm. If you do have a late night, have a relaxing day the next day, with maybe a short siesta (15mins) if possible, and try and get to bed earlier the following night!"
            , "<strong>TRAINING:</strong> If you are extremely busy over the Christmas season, your stress levels will be higher, so if you feel you need to train, just make sure you reduce the intensity and volume, aiming to finish each session feeling energised rather than fatigued. Your fitness levels will not improve if you try to train harder with all the extra stress, indeed pushing it too much could lead to illness or injury!"
            , "If you feel too tired to train, try going out for a relaxing walk on the beach or in the woods instead. With the added extra benefit of fresh air and sunlight (in between the clouds!), this is a great way to re-energise yourself, without adding extra stress. It is also a great way to spend some quality, fun time with the family, away from technology and any stresses! Breathing exercises, yoga or Tai-Chi are also excellent ways to help reduce your stress levels and improve your sense of well-being! Taking some quiet time out for yourself, amongst all the Christmas mayhem can make all the difference!"
            , "These are just a few simple strategies that can ensure you feel great and enjoy the festive season! If you would like some more information about our services, or indeed would like to sign up for some personal training with Elevate Health & Fitness in Truro, please do not hesitate to <a href='contactUs.php'>contact us</a> to arrange a free, no obligation consultation and begin the journey to elevating your health in 2017!"
            , "Have a great Christmas and awesome 2017!"
        ]
    }
]